-- phpMyAdmin SQL Dump
-- version 4.6.6deb4
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: May 23, 2018 at 11:35 PM
-- Server version: 10.1.23-MariaDB-9+deb9u1
-- PHP Version: 7.0.27-0+deb9u1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `db_ib`
--

-- --------------------------------------------------------

--
-- Table structure for table `pry_table`
--

CREATE TABLE `pry_table` (
  `date` date NOT NULL,
  `fjr` time NOT NULL,
  `shrq` time NOT NULL,
  `dhr` time NOT NULL,
  `asr` time NOT NULL,
  `mgrb` time NOT NULL,
  `ash` time NOT NULL,
  `midnight` time NOT NULL,
  `hadith_de` varchar(400) NOT NULL,
  `hadith_eng` varchar(400) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `pry_table`
--

INSERT INTO `pry_table` (`date`, `fjr`, `shrq`, `dhr`, `asr`, `mgrb`, `ash`, `midnight`, `hadith_de`, `hadith_eng`) VALUES
('2018-05-01', '04:07:00', '05:37:00', '13:12:00', '17:10:00', '20:35:00', '21:55:00', '00:00:00', '', ''),
('2018-05-02', '04:05:00', '05:35:00', '13:12:00', '17:11:00', '20:36:00', '21:56:00', '00:00:00', '', ''),
('2018-05-03', '04:03:00', '05:33:00', '13:12:00', '17:12:00', '20:38:00', '21:58:00', '00:00:00', '', ''),
('2018-05-04', '04:02:00', '05:32:00', '13:12:00', '17:12:00', '20:40:00', '22:00:00', '00:00:00', '', ''),
('2018-05-05', '04:00:00', '05:30:00', '13:11:00', '17:13:00', '20:41:00', '22:01:00', '00:00:00', '', ''),
('2018-05-06', '03:58:00', '05:28:00', '13:11:00', '17:14:00', '20:43:00', '22:03:00', '00:00:00', '', ''),
('2018-05-07', '03:56:00', '05:26:00', '13:11:00', '17:14:00', '20:44:00', '22:04:00', '00:00:00', '', ''),
('2018-05-08', '03:55:00', '05:25:00', '13:11:00', '17:15:00', '20:46:00', '22:06:00', '00:00:00', '', ''),
('2018-05-09', '03:53:00', '05:23:00', '13:11:00', '17:15:00', '20:47:00', '22:07:00', '00:00:00', '', ''),
('2018-05-10', '03:51:00', '05:21:00', '13:11:00', '17:16:00', '20:49:00', '22:09:00', '00:00:00', '', ''),
('2018-05-11', '03:50:00', '05:20:00', '13:11:00', '17:17:00', '20:50:00', '22:10:00', '00:00:00', '', ''),
('2018-05-12', '03:48:00', '05:18:00', '13:11:00', '17:17:00', '20:52:00', '22:12:00', '00:00:00', '', ''),
('2018-05-13', '03:47:00', '05:17:00', '13:11:00', '17:18:00', '20:53:00', '22:13:00', '00:00:00', '', ''),
('2018-05-14', '03:45:00', '05:15:00', '13:11:00', '17:18:00', '20:55:00', '22:15:00', '00:00:00', '', ''),
('2018-05-15', '03:44:00', '05:14:00', '13:11:00', '17:19:00', '20:56:00', '22:16:00', '00:00:00', 'The Messenger of Allah SAW said, When the month of Ramadan starts, the gates of the heaven are opened and the gates of Hell are closed and the devils are chained.', 'قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا دَخَلَ شَهْرُ رَمَضَانَ فُتِّحَتْ أَبْوَابُ السَّمَاءِ، وَغُلِّقَتْ أَبْوَابُ جَهَنَّمَ، وَسُلْسِلَتِ الشَّيَاطِينُ ‏\"‏‏.‏'),
('2018-05-16', '03:42:00', '05:12:00', '13:11:00', '17:20:00', '20:58:00', '22:18:00', '00:00:00', 'The Messenger of Allah SAW said, He who can afford to marry should marry, because it will help him refrain from looking at other women, and save his private parts from committing illegal sexual relation; and he who cannot afford to marry is advised to fast, as fasting will diminish his sexual power', 'حَدَّثَنَا عَبْدَانُ مَنِ اسْتَطَاعَ الْبَاءَةَ فَلْيَتَزَوَّجْ، فَإِنَّهُ أَغَضُّ لِلْبَصَرِ وَأَحْصَنُ لِلْفَرْجِ، وَمَنْ لَمْ يَسْتَطِعْ فَعَلَيْهِ بِالصَّوْمِ، فَإِنَّهُ لَهُ وِجَاءٌ ‏\"‏‏.‏'),
('2018-05-17', '03:41:00', '05:11:00', '13:11:00', '17:20:00', '20:59:00', '22:19:00', '00:00:00', 'The Prophet (ﷺ) or Abul-Qasim said, \"Start fasting on seeing the crescent (of Ramadan), and give up fasting on seeing the crescent (of Shawwal), and if the sky is overcast (and you cannot see it), complete thirty days of Shaban.\"', 'قَالَ أَبُو الْقَاسِمِ صلى الله عليه وسلم ‏ \"‏ صُومُوا لِرُؤْيَتِهِ، وَأَفْطِرُوا لِرُؤْيَتِهِ، فَإِنْ غُبِّيَ عَلَيْكُمْ فَأَكْمِلُوا عِدَّةَ شَعْبَانَ ثَلاَثِينَ ‏\"‏‏.‏\r\n'),
('2018-05-18', '03:40:00', '05:10:00', '13:11:00', '17:21:00', '21:01:00', '22:21:00', '00:00:00', 'The Prophet (ﷺ) said, \"None of you should fast a day or two before the month of Ramadan unless he has the habit of fasting (Nawafil) (and if his fasting coincides with that day) then he can fast that day.\"', 'عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَتَقَدَّمَنَّ أَحَدُكُمْ رَمَضَانَ بِصَوْمِ يَوْمٍ أَوْ يَوْمَيْنِ، إِلاَّ أَنْ يَكُونَ رَجُلٌ كَانَ يَصُومُ صَوْمَهُ فَلْيَصُمْ ذَلِكَ الْيَوْمَ ‏\"‏‏.‏'),
('2018-05-19', '03:38:00', '05:08:00', '13:11:00', '17:21:00', '21:02:00', '22:22:00', '00:00:00', '', ''),
('2018-05-20', '03:37:00', '05:07:00', '13:11:00', '17:22:00', '21:03:00', '22:23:00', '00:00:00', '', ''),
('2018-05-21', '03:36:00', '05:06:00', '13:11:00', '17:22:00', '21:05:00', '22:25:00', '00:00:00', '', ''),
('2018-05-22', '03:35:00', '05:05:00', '13:11:00', '17:23:00', '21:06:00', '22:26:00', '00:00:00', '', ''),
('2018-05-23', '03:33:00', '05:03:00', '13:12:00', '17:23:00', '21:07:00', '22:27:00', '00:00:00', '', ''),
('2018-05-24', '03:32:00', '05:02:00', '13:12:00', '17:24:00', '21:09:00', '22:29:00', '00:00:00', '', ''),
('2018-05-25', '03:31:00', '05:01:00', '13:12:00', '17:24:00', '21:10:00', '22:30:00', '00:00:00', '', ''),
('2018-05-26', '03:30:00', '05:00:00', '13:12:00', '17:25:00', '21:11:00', '22:31:00', '00:00:00', 'Allah swt says: \"Fasting is like a shield, and he who fasts has two joys: a joy when he breaks his fast and a joy when he meets his Lord\"', 'قَالَ اللَّهُ عَزَّ وَجَلَّ: وَلِلصَّائِمِ فَرْحَتَانِ: فَرْحَةٌ حِينَ يُفْطِرُ، وَفَرْحَةٌ حِينَ يَلْقَى رَبَّهُ، وَلَخُلُوفُ'),
('2018-05-27', '03:29:00', '04:59:00', '13:12:00', '17:25:00', '21:12:00', '22:32:00', '00:00:00', '', ''),
('2018-05-28', '03:28:00', '04:58:00', '13:12:00', '17:26:00', '21:14:00', '22:34:00', '00:00:00', '', ''),
('2018-05-29', '03:27:00', '04:57:00', '13:12:00', '17:26:00', '21:15:00', '22:35:00', '00:00:00', '', ''),
('2018-05-30', '03:26:00', '04:56:00', '13:12:00', '17:27:00', '21:16:00', '22:36:00', '00:00:00', '', ''),
('2018-05-31', '03:25:00', '04:55:00', '13:12:00', '17:27:00', '21:17:00', '22:37:00', '00:00:00', '', '');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
